<template>
	<div id="help">
		<h2>Помощь</h2>
		<h4>Переход на главную страницу</h4>
		<p>
			Нажмите на логотип "СЭД МТУСИ".
		</p>
		<h4>Создание документа</h4>
		<p>
			Нажмите на иконку создания документа со знаком плюса, которая расположена 
			в панели сверху, с правой стороны.
		</p>
		<h4>Изменение картотеки</h4>
		<p>
			Картотеку можно поменять в меню главной страницы. Уведомления отображаются 
			независимо от картотеки.
		</p>
		<h4>Просмотр документа</h4>
		<p>
			Просматрировать содержимое можно только у документов размером меньше 25мб.
		</p>
		<h4>Профиль</h4>
		<p>
			Профиль позволяет просматривать уведомления, изменять личную информацию, 
			выйти из аккаунта и, в случае администратора, управлять правами пльзователей.
			Зайти в профиль можно, кликнув на круглую иконку с картинкой вашего профиля 
			в панели сверху, с правой стороны.
		</p>
		<h4>Уведомления</h4>
		<p>
			Уведомления можно посмотреть в профиле или кликнув на иконку с колокольчиком в 
			панели сверху, с правой стороны.
		</p>
		<h4>Администрирование</h4>
		<p>
			Через вкладку в профиле "Администрирование" (присутствует, если пользователь 
			является администратором) можно добавлять новых пользователей по их email, а 
			также изменять права (администратор или нет). Для изменения права достаточно 
			найти в таблице нужного пользователя и кликнуть по иконке в столбце "Администратор".
		</p>
		<p>
			Также здесь можно управлять картотеками и приставками к регистрационным номерам 
			(создавать, переименовывать, удалять).
		</p>
	</div>
</template>

<script>
export default {
	name: 'Help',
	data () {
		return {
			help: help
		}
	},
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
#help{
    width: 100%;
	max-width: 900px;
	margin: auto;
	margin-top: 0;
	margin-bottom: 0;
}
</style>